Revit 2027 API
LineSegment.StartPoint Property
 Start point of the line segment.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ StartPoint { get; }
Public ReadOnly Property StartPoint As XYZ
	Get
public:
property XYZ^ StartPoint {
	XYZ^ get ();
}
member StartPoint : XYZ with get
Property Value
XYZ
See Also
Reference
LineSegment Class
Autodesk.Revit.DB Namespace